[
  {
    "name":"Charm Person",
    "desc":"<p>You attempt to charm a humanoid you can see within range. It must make a wisdom saving throw, and does so with advantage if you or your companions are fighting it. If it fails the saving throw, it is charmed by you until the spell ends or until you or your companions do anything harmful to it. The charmed creature regards you as a friendly acquaintance. When the spell ends, the creature knows it was charmed by you.</p>",
    "higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, you can target one additional creature for each slot level above 1st. The creatures must be within 30 feet of each other when you target them.</p>",
    "page":"phb 221",
    "range":"30 feet",
    "components":"V, S",
    "ritual":"no",
    "duration":"1 hour",
    "concentration":"no",
    "casting_time":"1 action",
    "level":"1st-level",
    "school":"Enchantment",
    "class":"Bard, Cleric, Druid, Sorcerer, Warlock, Wizard",
    "archetype":"Cleric: Trickery",
    "domains":"Trickery"
  },
  {
    "name":"Cure Wounds",
    "desc":"<p>A creature you touch regains a number of hit points equal to 1d8 + your spellcasting ability modifier. This spell has no effect on undead or constructs.</p>",
    "higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, the healing increases by 1d8 for each slot level above 1st.</p>",
    "page":"phb 230",
    "range":"Touch",
    "components":"V, S",
    "ritual":"no",
    "duration":"Instantaneous",
    "concentration":"no",
    "casting_time":"1 action",
    "level":"1st-level",
    "school":"Evocation",
    "class":"Bard, Cleric, Druid, Paladin, Ranger",
    "domains":"Life"
  },
  {
    "name":"Detect Magic",
    "desc":"<p>For the duration, you sense the presence of magic within 30 feet of you. If you sense magic in this way, you can use your action to see a faint aura around any visible creature or object in the area that bears magic, and you learn its school of magic, if any.</p><p>The spell can penetrate most barriers, but it is blocked by 1 foot of stone, 1 inch of common metal, a thin sheet of lead, or 3 feet of wood or dirt.</p>",
    "page":"phb 231",
    "range":"Self",
    "components":"V, S",
    "ritual":"yes",
    "duration":"Up to 10 minutes",
    "concentration":"yes",
    "casting_time":"1 action",
    "level":"1st-level",
    "school":"Divination",
    "class":"Bard, Cleric, Druid, Paladin, Ranger, Ritual Caster, Sorcerer, Wizard"
  },
  {
    "name":"Entangle",
    "desc":"<p>Grasping weeds and vines sprout from the ground in a 20-foot square starting form a point within range. For the duration, these plants turn the ground in the area into difficult terrain.</p><p>A creature in the area when you cast the spell must succeed on a strength saving throw or be restrained by the entangling plants until the spell ends. A creature restrained by the plants can use its action to make a Strength check against your spell save DC. On a success, it frees itself.</p><p>When the spell ends, the conjured plants wilt away.</p>",
    "page":"phb 238",
    "range":"90 feet",
    "components":"V, S",
    "ritual":"no",
    "duration":"Up to 1 minute",
    "concentration":"yes",
    "casting_time":"1 action",
    "level":"1st-level",
    "school":"Conjuration",
    "class":"Druid"
  },
  {
    "name":"Locate Object",
    "desc":"<p>Describe or name an object that is familiar to you. You sense the direction to the object's location, as long as that object is within 1,000 feet of you. If the object is in motion, you know the direction of its movement.</p><p>The spell can locate a specific object known to you, as long as you have seen it up close—within 30 feet—at least once. Alternatively, the spell can locate the nearest object of a particular kind, such as a certain kind of apparel, jewelry, furniture, tool, or weapon.</p><p>This spell can't locate an object if any thickness of lead, even a thin sheet, blocks a direct path between you and the object.</p>",
    "page":"phb 256",
    "range":"Self",
    "components":"V, S, M",
    "material":"A forked twig.",
    "ritual":"no",
    "duration":"Up to 10 minutes",
    "concentration":"yes",
    "casting_time":"1 action",
    "level":"2nd-level",
    "school":"Divination",
    "class":"Bard, Cleric, Druid, Paladin, Ranger, Wizard"
  },
  {
    "name":"Moonbeam",
    "desc":"<p>A silvery beam of pale light shines down in a 5-footradius, 40-foot-high cylinder centered on a point within range. Until the spell ends, dim light fills the cylinder.</p><p>When a creature enters the spell's area for the first time on a turn or starts its turn there, it is engulfed in ghostly flames that cause searing pain, and it must make a constitution saving throw. It takes 2d10 radiant damage on a failed save, or half as much damage on a successful one.</p><p>A shapechanger makes its saving throw with disadvantage. If it fails, it also instantly reverts to its original form and can't assume a different form until it leaves the spell's light.</p><p>On each of your turns after you cast this spell, you can use an action to move the beam 60 feet in any direction.</p>",
    "higher_level":"<p>When you cast this spell using a spell slot of 3rd level or higher, the damage increases by 1dlO for each slot level above 2nd.</p>",
    "page":"phb 261",
    "range":"120 feet",
    "components":"V, S, M",
    "material":"Several seeds of any moonseed plant and a piece of opalescent feldspar.",
    "ritual":"no",
    "duration":"Up to 1 minute",
    "concentration":"yes",
    "casting_time":"1 action",
    "level":"2nd-level",
    "school":"Evocation",
    "class":"Druid, Paladin",
    "archetype":"Paladin: Ancients",
    "oaths":"Ancients"
  },
  {
    "name":"Pass without Trace",
    "desc":"<p>A veil of shadows and silence radiates from you, masking you and your companions from detection. For the duration, each creature you choose within 30 feet of you (including you) has a +10 bonus to Dexterity (Stealth) checks and can't be tracked except by magical means. A creature that receives this bonus leaves behind no tracks or other traces of its passage.</p>",
    "page":"phb 264",
    "range":"Self",
    "components":"V, S, M",
    "material":"Ashes from a burned leaf of mistletoe and a sprig of spruce.",
    "ritual":"no",
    "duration":"Up to 1 hour",
    "concentration":"yes",
    "casting_time":"1 action",
    "level":"2nd-level",
    "school":"Abjuration",
    "class":"Cleric, Druid, Ranger",
    "archetype":"Cleric: Trickery",
    "domains":"Trickery",
    "circles":"Grassland"
  },
  {
    "name":"Produce Flame",
    "desc":"<p>A flickering flame appears in your hand. The flame remains there for the duration and harms neither you nor your equipment. The flame sheds bright light in a 10-foot radius and dim light for an additional 10 feet. The spell ends if you dismiss it as an action or if you cast it again.</p><p>You can also attack with the flame, although doing so ends the spell. When you cast this spell, or as an action on a later turn, you can hurl the flame at a creature within 30 feet of you. Make a ranged spell attack. On a hit, the target takes 1d8 fire damage.</p><p>This spell's damage increases by 1d8 when you reach 5th level (2d8), 11th level (3d8), and 17th level (4d8).</p>",
    "page":"phb 269",
    "range":"Self",
    "components":"V, S",
    "ritual":"no",
    "duration":"10 minutes",
    "concentration":"no",
    "casting_time":"1 action",
    "level":"Cantrip",
    "school":"Conjuration",
    "class":"Druid"
  },
  {
    "name":"Shillelagh",
    "desc":"<p>The wood of a club or a quarterstaff you are holding is imbued with nature's power. For the duration, you can use your spellcasting ability instead of Strength for the attack and damage rolls of melee attacks using that weapon, and the weapon's damage die becomes a d8. The weapon also becomes magical, if it isn't already. The spell ends if you cast it again or if you let go of the weapon.</p>",
    "page":"phb 275",
    "range":"Touch",
    "components":"V, S, M",
    "material":"Mistletoe, a shamrock leaf, and a club or quarterstaff.",
    "ritual":"no",
    "duration":"1 minute",
    "concentration":"no",
    "casting_time":"1 bonus action",
    "level":"Cantrip",
    "school":"Transmutation",
    "class":"Druid"
  },
  {
    "name":"Thorn Whip",
    "desc":"<p>You create a long, vine-like whip covered in thorns that lashes out at your command toward a creature in range. Make a melee spell attack against the target. If the attack hits, the creature takes 1d6 piercing damage, and if the creature is Large or smaller, you pull the creature up to 10 feet closer to you.</p><p>This spell's damage increases by 1d6 when you reach 5th level (2d6), 11th level (3d6), and 17th level (4d6).</p>",
    "page":"phb 282",
    "range":"30 feet",
    "components":"V, S, M",
    "material":"The stem of a plant with thorns.",
    "ritual":"no",
    "duration":"Instantaneous",
    "concentration":"no",
    "casting_time":"1 action",
    "level":"Cantrip",
    "school":"Transmutation",
    "class":"Druid"
  },
  {
    "name":"Thunderwave",
    "desc":"<p>A wave of thunderous force sweeps out from you. Each creature in a 15-foot cube originating from you must make a constitution saving throw. On a failed save, a creature takes 2d8 thunder damage and is pushed 10 feet away from you. On a successful save, the creature takes half as much damage and isn't pushed.</p><p>In addition, unsecured objects that are completely within the area of effect are automatically pushed 10 feet away from you by the spell's effect, and the spell emits a thunderous boom audible out to 300 feet.</p>",
    "higher_level":"<p>When you cast this spell using a spell slot of 2nd level or higher, the damage increases by 1d8 for each slot level above 1st.</p>",
    "page":"phb 282",
    "range":"Self",
    "components":"V, S",
    "ritual":"no",
    "duration":"Instantaneous",
    "concentration":"no",
    "casting_time":"1 action",
    "level":"1st-level",
    "school":"Evocation",
    "class":"Bard, Cleric, Druid, Sorcerer, Wizard",
    "archetype":"Cleric: Tempest",
    "domains":"Tempest"
  }
]